[
  {
    "id": 1,
    "title": "Senior Product Designer",
    "company": "Stripe",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "typeColor": "blue",
    "companyInitial": "S",
    "companyColor": "from-blue-500 to-blue-600",
    "description": "We're looking for a Senior Product Designer to join our growing design team. You'll work on designing intuitive payment experiences for millions of businesses worldwide. In this role, you'll collaborate closely with product managers, engineers, and researchers to create seamless payment flows that simplify financial operations for companies of all sizes. You'll be responsible for the entire design process from concept to implementation, ensuring our products are both beautiful and functional.",
    "fullDescription": "As a Senior Product Designer at Stripe, you will be at the forefront of redefining how businesses handle payments online. You'll tackle complex financial workflows and transform them into intuitive, accessible experiences. Your day-to-day will involve creating wireframes, prototypes, and high-fidelity designs while maintaining our design system. You'll conduct user research to understand merchant needs and translate those insights into elegant solutions. This position offers the opportunity to impact Stripe's core payment products used by millions of businesses globally, from startups to Fortune 500 companies.",
    "responsibilities": [
      "Lead design projects from discovery to delivery across Stripe's payment products",
      "Create user flows, wireframes, prototypes, and high-fidelity visual designs",
      "Conduct user research and usability testing to inform design decisions",
      "Collaborate with cross-functional teams including product, engineering, and data science",
      "Contribute to and evolve Stripe's design system and component library",
      "Mentor junior designers and provide design feedback"
    ],
    "skills": ["Figma", "User Research", "Prototyping", "Design Systems", "UI/UX Design", "Interaction Design", "Information Architecture"],
    "niceToHave": ["FinTech Experience", "Developer Empathy", "Data Analysis", "Motion Design", "HTML/CSS Basics", "Accessibility Expertise"],
    "experience": "5+ years",
    "salary": "$150k - $200k",
    "equity": "$30k - $50k/year",
    "benefits": ["Health/Dental/Vision", "Unlimited PTO", "401(k) Matching", "Parental Leave", "Remote Work Stipend", "Learning Budget"],
    "postedDate": "2024-01-15",
    "applicationDeadline": "2024-02-28",
    "applicants": 245,
    "remotePolicy": "Hybrid (3 days in office)",
    "teamSize": "15 designers",
    "companySize": "7000+ employees",
    "hiringManager": "Alex Chen, Design Director"
  },
  {
    "id": 2,
    "title": "Frontend Engineer",
    "company": "Figma",
    "location": "Remote - Worldwide",
    "type": "Remote",
    "typeColor": "emerald",
    "companyInitial": "F",
    "companyColor": "from-emerald-500 to-emerald-600",
    "description": "Join our frontend team to build the next generation of design tools used by millions of designers and developers. You'll work on challenging technical problems involving real-time collaboration, performance optimization, and creating intuitive interfaces that push the boundaries of web technology.",
    "fullDescription": "As a Frontend Engineer at Figma, you'll be building the core web application that designers and developers use every day. You'll tackle complex challenges like real-time multiplayer editing, rendering performance optimization for large design files, and creating smooth, intuitive interactions. Our stack includes React, TypeScript, and WebGL for canvas rendering. You'll work closely with designers to implement pixel-perfect UI while ensuring our application remains fast and reliable at scale. This role offers the unique opportunity to shape the future of design tools while working with cutting-edge web technologies.",
    "responsibilities": [
      "Develop and maintain features in Figma's web application using React and TypeScript",
      "Optimize rendering performance for complex design files and real-time collaboration",
      "Implement responsive and accessible user interfaces",
      "Collaborate with designers to translate mockups into functional components",
      "Write clean, maintainable code with comprehensive tests",
      "Participate in code reviews and architectural discussions"
    ],
    "skills": ["React", "TypeScript", "JavaScript", "CSS", "WebGL", "Performance Optimization", "State Management"],
    "niceToHave": ["Canvas API", "WebAssembly", "GraphQL", "Testing (Jest/Vitest)", "WebRTC", "Computer Graphics"],
    "experience": "3+ years",
    "salary": "$130k - $180k",
    "equity": "$40k - $70k/year",
    "benefits": ["Full Remote", "Health Insurance", "Flexible Hours", "Stock Options", "Home Office Budget", "Annual Retreat"],
    "postedDate": "2024-01-18",
    "applicationDeadline": "2024-03-15",
    "applicants": 312,
    "remotePolicy": "Fully Remote",
    "teamSize": "8 engineers",
    "companySize": "1200+ employees",
    "hiringManager": "Maria Rodriguez, Engineering Manager"
  },
  {
    "id": 3,
    "title": "Data Science Intern",
    "company": "Notion",
    "location": "New York, NY",
    "type": "Internship",
    "typeColor": "violet",
    "companyInitial": "N",
    "companyColor": "from-violet-500 to-violet-600",
    "description": "Join our data science team for a summer internship where you'll work on real projects that impact millions of users. You'll analyze user behavior, build predictive models, and help shape product decisions with data-driven insights.",
    "fullDescription": "As a Data Science Intern at Notion, you'll be embedded in our product analytics team for 12 weeks during summer 2024. You'll work on meaningful projects that directly influence product decisions affecting millions of users worldwide. Potential projects include analyzing feature adoption patterns, building churn prediction models, or optimizing our recommendation algorithms. You'll have access to rich datasets and mentorship from senior data scientists while contributing to real business problems. This internship is designed to provide hands-on experience in a fast-paced tech environment while working on problems that matter.",
    "responsibilities": [
      "Analyze large datasets to uncover insights about user behavior and product usage",
      "Build and evaluate predictive models using machine learning techniques",
      "Create data visualizations and dashboards to communicate findings",
      "Collaborate with product managers and engineers to design experiments",
      "Present findings and recommendations to cross-functional teams",
      "Document methodologies and results for knowledge sharing"
    ],
    "skills": ["Python", "SQL", "Statistics", "Data Visualization", "Machine Learning", "Pandas", "NumPy"],
    "niceToHave": ["R Programming", "Tableau", "Apache Spark", "Natural Language Processing", "A/B Testing", "BigQuery"],
    "experience": "Currently pursuing degree",
    "salary": "$40/hour",
    "equity": "N/A",
    "benefits": ["Housing Stipend", "Relocation Assistance", "Mentorship Program", "Social Events", "Career Development"],
    "postedDate": "2024-01-10",
    "applicationDeadline": "2024-02-20",
    "applicants": 189,
    "remotePolicy": "On-site required",
    "teamSize": "5 data scientists",
    "companySize": "500+ employees",
    "hiringManager": "David Kim, Lead Data Scientist",
    "internshipDuration": "12 weeks (June-August 2024)"
  },
  {
    "id": 4,
    "title": "Marketing Manager",
    "company": "Linear",
    "location": "Los Angeles, CA",
    "type": "Full-time",
    "typeColor": "amber",
    "companyInitial": "L",
    "companyColor": "from-amber-500 to-orange-500",
    "description": "Lead our marketing efforts to grow Linear's brand and user base. You'll develop and execute marketing strategies across multiple channels, analyze performance metrics, and work closely with product teams to align messaging.",
    "fullDescription": "As Marketing Manager at Linear, you'll own the strategy and execution of our marketing initiatives to drive user growth and brand awareness. You'll work at the intersection of product, design, and engineering to tell compelling stories about how Linear helps teams build better software. Your responsibilities will span content marketing, performance marketing, community building, and brand partnerships. You'll analyze market trends, identify growth opportunities, and develop campaigns that resonate with our target audience of developers and engineering leaders. This role requires both creative thinking and analytical rigor to build marketing programs that scale.",
    "responsibilities": [
      "Develop and execute integrated marketing campaigns across multiple channels",
      "Create compelling content including blog posts, case studies, and social media",
      "Manage performance marketing budgets and optimize ROI",
      "Analyze market trends and competitive landscape",
      "Collaborate with product teams on launch strategies and messaging",
      "Build relationships with influencers and community partners"
    ],
    "skills": ["Digital Marketing", "Content Strategy", "SEO/SEM", "Analytics", "Brand Management", "Copywriting", "Campaign Management"],
    "niceToHave": ["Product Marketing", "Growth Hacking", "Email Marketing", "Social Media Ads", "Community Building", "Event Planning"],
    "experience": "4+ years",
    "salary": "$120k - $160k",
    "equity": "$25k - $40k/year",
    "benefits": ["Health Benefits", "Unlimited Vacation", "Stock Options", "Learning Budget", "Wellness Stipend", "Team Offsites"],
    "postedDate": "2024-01-20",
    "applicationDeadline": "2024-03-10",
    "applicants": 167,
    "remotePolicy": "Hybrid (2 days in office)",
    "teamSize": "6 marketing team members",
    "companySize": "150+ employees",
    "hiringManager": "Sarah Johnson, Head of Marketing"
  },
  {
    "id": 5,
    "title": "Backend Developer",
    "company": "Airbnb",
    "location": "Remote - US Only",
    "type": "Remote",
    "typeColor": "rose",
    "companyInitial": "A",
    "companyColor": "from-rose-500 to-pink-500",
    "description": "Build scalable backend systems that power Airbnb's platform serving millions of guests and hosts worldwide. You'll work on core services including booking, payments, search, and messaging while ensuring high reliability and performance.",
    "fullDescription": "As a Backend Developer at Airbnb, you'll join our platform engineering team to build and scale the systems that power our global marketplace. You'll work on challenging distributed systems problems involving real-time inventory management, payment processing, search ranking, and messaging at scale. Our stack includes modern technologies like Node.js, Python, and various AWS services. You'll be responsible for designing, implementing, and maintaining services that must handle millions of requests daily with high availability. This role offers the opportunity to work on technical challenges at massive scale while contributing to a product that connects people around the world.",
    "responsibilities": [
      "Design, build, and maintain scalable backend services and APIs",
      "Optimize system performance and reliability for high-traffic applications",
      "Implement data models and database schemas for new features",
      "Write clean, tested, and documented code following best practices",
      "Participate in on-call rotation and incident response",
      "Collaborate with frontend engineers and product managers"
    ],
    "skills": ["Node.js", "Python", "PostgreSQL", "Redis", "AWS", "Docker", "Microservices", "API Design"],
    "niceToHave": ["Kubernetes", "GraphQL", "MongoDB", "System Design", "Go", "Terraform", "CI/CD", "Monitoring"],
    "experience": "3+ years",
    "salary": "$140k - $190k",
    "equity": "$35k - $60k/year",
    "benefits": ["Remote-first", "Health Insurance", "Travel Credit", "Learning Budget", "Parental Leave", "Flexible Schedule"],
    "postedDate": "2024-01-22",
    "applicationDeadline": "2024-03-31",
    "applicants": 278,
    "remotePolicy": "Fully Remote (US only)",
    "teamSize": "12 backend engineers",
    "companySize": "6000+ employees",
    "hiringManager": "Michael Brown, Senior Engineering Manager"
  },
  {
    "id": 6,
    "title": "UX Research Intern",
    "company": "Vercel",
    "location": "Austin, TX",
    "type": "Internship",
    "typeColor": "cyan",
    "companyInitial": "V",
    "companyColor": "from-cyan-500 to-teal-500",
    "description": "Join our UX research team to help understand developer needs and improve the Vercel platform. You'll conduct user studies, analyze feedback, and present insights that inform product decisions for our developer tools.",
    "fullDescription": "As a UX Research Intern at Vercel, you'll spend 10 weeks working alongside our research team to understand how developers use our platform and identify opportunities for improvement. You'll plan and execute research studies using various methodologies including user interviews, usability testing, surveys, and diary studies. Your work will directly influence product decisions for Vercel's frontend cloud platform used by thousands of developers and companies. You'll learn how to translate raw feedback into actionable insights while building a portfolio of real-world research projects. This internship is ideal for students passionate about both technology and human-centered design.",
    "responsibilities": [
      "Assist in planning and conducting user research studies",
      "Recruit and schedule participants for research sessions",
      "Analyze qualitative and quantitative data to identify user needs",
      "Create research reports and presentations to share findings",
      "Collaborate with designers and product managers on research plans",
      "Help maintain our user research repository and participant database"
    ],
    "skills": ["User Research", "Usability Testing", "Data Analysis", "Figma", "Communication", "Interviewing", "Synthesis"],
    "niceToHave": ["Developer Experience", "Technical Writing", "A/B Testing", "Prototyping", "Survey Design", "Mixed Methods"],
    "experience": "Currently pursuing degree",
    "salary": "$35/hour",
    "equity": "N/A",
    "benefits": ["Housing Assistance", "Travel Coverage", "Mentorship", "Networking Events", "Project Portfolio"],
    "postedDate": "2024-01-12",
    "applicationDeadline": "2024-02-25",
    "applicants": 134,
    "remotePolicy": "On-site preferred (hybrid possible)",
    "teamSize": "4 UX researchers",
    "companySize": "800+ employees",
    "hiringManager": "Jennifer Lee, UX Research Lead",
    "internshipDuration": "10 weeks (June-August 2024)"
  },
  {
    "id": 7,
    "title": "DevOps Engineer",
    "company": "Spotify",
    "location": "Stockholm, Sweden",
    "type": "Full-time",
    "typeColor": "green",
    "companyInitial": "S",
    "companyColor": "from-green-500 to-green-600",
    "description": "Join our infrastructure team to build and maintain the platform that delivers music to 400+ million users worldwide. You'll work on scaling our cloud infrastructure, improving deployment pipelines, and ensuring high availability.",
    "fullDescription": "As a DevOps Engineer at Spotify, you'll be part of our platform engineering team responsible for the infrastructure that streams music to millions of users daily. You'll work with cutting-edge technologies to build scalable, reliable systems in Google Cloud Platform. Your focus will be on improving our CI/CD pipelines, implementing infrastructure as code, optimizing costs, and enhancing monitoring and alerting systems. You'll collaborate with development teams across the company to empower them with better tooling and practices. This role offers the challenge of working at massive scale while contributing to a product loved by users worldwide.",
    "responsibilities": [
      "Design and implement cloud infrastructure using Terraform and Kubernetes",
      "Build and maintain CI/CD pipelines for hundreds of microservices",
      "Implement monitoring, logging, and alerting solutions",
      "Optimize cloud costs and resource utilization",
      "Ensure security best practices across infrastructure",
      "Participate in incident response and post-mortems"
    ],
    "skills": ["Kubernetes", "Docker", "Terraform", "GCP/AWS", "CI/CD", "Linux", "Bash", "Python/Go"],
    "niceToHave": ["Service Mesh", "Observability", "Database Management", "Networking", "Security", "SRE Practices"],
    "experience": "4+ years",
    "salary": "$135k - $185k",
    "equity": "$30k - $50k/year",
    "benefits": ["Relocation Support", "Health Insurance", "Flexible Hours", "Stock Options", "Music Credits", "6 Months Parental Leave"],
    "postedDate": "2024-01-25",
    "applicationDeadline": "2024-03-20",
    "applicants": 198,
    "remotePolicy": "Hybrid (Stockholm office)",
    "teamSize": "8 DevOps engineers",
    "companySize": "8000+ employees",
    "hiringManager": "Anders Nilsson, Infrastructure Lead"
  },
  {
    "id": 8,
    "title": "Product Manager",
    "company": "Slack",
    "location": "Remote - North America",
    "type": "Full-time",
    "typeColor": "purple",
    "companyInitial": "S",
    "companyColor": "from-purple-500 to-purple-600",
    "description": "Lead product strategy for core collaboration features used by millions of teams daily. You'll define the roadmap, prioritize features, and work cross-functionally to deliver improvements that make work simpler and more productive.",
    "fullDescription": "As a Product Manager at Slack, you'll own the strategy and execution for key areas of our collaboration platform. You'll be responsible for understanding user needs, defining product requirements, and working with engineering and design teams to bring features to life. Your focus will be on improving core messaging, channels, or search functionality used by millions of users daily. You'll analyze usage data, conduct competitive research, and gather customer feedback to inform your roadmap. This role requires balancing user needs, business goals, and technical constraints to deliver value to both free and paid teams.",
    "responsibilities": [
      "Define product vision, strategy, and roadmap for assigned areas",
      "Write clear product requirements and user stories",
      "Analyze product metrics and user feedback to identify opportunities",
      "Work closely with engineering, design, and marketing teams",
      "Prioritize features and manage trade-offs",
      "Communicate product plans and progress to stakeholders"
    ],
    "skills": ["Product Strategy", "Roadmapping", "Data Analysis", "User Research", "Agile Methodology", "Stakeholder Management"],
    "niceToHave": ["B2B SaaS Experience", "API Product Management", "Enterprise Software", "Technical Background", "Growth Marketing"],
    "experience": "5+ years",
    "salary": "$160k - $220k",
    "equity": "$50k - $80k/year",
    "benefits": ["Remote Work", "Health Benefits", "Equity Grants", "Learning Stipend", "Wellness Reimbursement", "Generous PTO"],
    "postedDate": "2024-01-28",
    "applicationDeadline": "2024-03-25",
    "applicants": 301,
    "remotePolicy": "Fully Remote (North America)",
    "teamSize": "Product team of 25",
    "companySize": "2000+ employees",
    "hiringManager": "Taylor Smith, VP of Product"
  }
]